{
  "custom": true,
  "roles": [
    {
      "company": "BMO Financial Group",
      "companySlug": "bmo",
      "title": "Business Systems Analyst Intern",
      "topSkills": ["Data Analysis", "Business Requirements", "Agile Delivery", "Process Improvement", "Stakeholder Management"],
      "pitch": "I like working at the intersection of technical systems and business needs. I've built Power BI dashboards with role-based views, led Agile teams through sprint planning and CI/CD setup, and automated reporting workflows with Power Automate. I'm looking to bring that same mix of analytical thinking and cross-functional collaboration to BMO as a Business Systems Analyst.",
      "relevantHighlights": ["Data Analysis & KPI Reporting", "CI/CD Pipelines & Agile Delivery", "Power Automate, Azure AD & SharePoint Integration"],
      "relevantProjects": ["oil-gas-asset-integrity-dashboard", "production-analytics-forecasting-dashboard", "business-tracking-application"]
    },
    {
      "company": "City of Calgary",
      "companySlug": "city-of-calgary/it-dev-student",
      "title": "IT Developer Summer Student",
      "topSkills": ["Power Automate & SharePoint", "CI/CD & DevOps", "Secure Backend Dev", "React & APIs", "Documentation & Pilots"],
      "pitch": "I've built Power Automate workflows, integrated Azure AD with Microsoft Graph API for SharePoint file I/O, and set up CI/CD pipelines with GitHub Actions across multiple projects. I also have experience hardening web apps for 1,000+ users and writing technical documentation (SOPs, onboarding guides) to support handoffs and long-term system upkeep. I'd love to bring that to the City of Calgary's IT team this summer.",
      "resumePath": "/Zohair_Omar_Resume_CityOfCalgary_ITDev_0304.pdf",
      "relevantHighlights": ["Power Automate, Azure AD & SharePoint Integration", "React, APIs & Full-Stack Development", "CI/CD Pipelines & Agile Delivery", "Secure Backend Development"],
      "relevantProjects": ["ticket-triage-rag-bot", "incident-command", "production-analytics-forecasting-dashboard"],
      "tailoredExperience": [
        {
          "name": "Enactus UCalgary - WealthPath",
          "title": "Front-End Development Lead",
          "dates": "Jul 2025 - Present",
          "stack": "React, TypeScript, GitHub Actions, CI/CD",
          "bullets": [
            "Implemented a CI/CD pipeline with GitHub Actions for automated testing and quality checks; supported 30+ successful merges without regression",
            "Built a reusable React/TypeScript component library adopted across 5+ core pages, reducing duplicate code by approximately 20%",
            "Coordinated with the back-end team to define API contracts and resolve integration issues, accelerating feature delivery by 1-2 sprints"
          ]
        },
        {
          "name": "TechNova",
          "title": "Co-Founder & VP Technical",
          "dates": "Feb 2025 - Present",
          "stack": "React, JavaScript, Python, SQL, Git",
          "bullets": [
            "Built full-stack websites for clubs using React, Python & SQL, focusing on modular design and maintainability",
            "Implemented user login, responsive UIs, and dashboards to improve functionality & user experience for 100+ users",
            "Led a team of 4 developers through Agile sprints, leveraging Git and code reviews for clean, testable code"
          ]
        },
        {
          "name": "Agrius IT",
          "title": "Software Developer Intern",
          "dates": "May 2024 - Jul 2024",
          "stack": "Python, SQL, JavaScript, HTML/CSS",
          "bullets": [
            "Fortified web application security by integrating CORS, proxy settings, and robust error handling while maintaining access for 1,000+ daily users",
            "Developed secure backend functionality including user authentication and role-based access control (RBAC)",
            "Documented workflows and contributed to internal SOPs for issue resolution and system operations"
          ]
        }
      ]
    },
    {
      "company": "City of Calgary",
      "companySlug": "city-of-calgary/business-analyst-student",
      "title": "Business Analyst Student",
      "topSkills": ["Excel & Power BI Analytics", "Documentation & SOPs", "Office 365", "Agile/Scrum", "Stakeholder Presentations"],
      "pitch": "I've built Power BI dashboards with DAX measures and role-based views, written SOPs and onboarding documentation, and collaborated across Agile teams to deliver features on schedule. Whether it's analyzing data in Excel, creating process documentation in Word, or presenting insights to stakeholders, I focus on clear communication and actionable results. I'm excited to bring that analytical mindset and documentation experience to the City of Calgary.",
      "resumePath": "/Zohair_Omar_Resume_CityOfCalgary_BA_0304.pdf",
      "relevantHighlights": ["Data Analysis & KPI Reporting", "Power Automate, Azure AD & SharePoint Integration", "CI/CD Pipelines & Agile Delivery"],
      "relevantProjects": ["oil-gas-asset-integrity-dashboard", "production-analytics-forecasting-dashboard", "business-tracking-application"],
      "tailoredExperience": [
        {
          "name": "Enactus UCalgary - WealthPath",
          "title": "Front-End Development Lead",
          "dates": "Jul 2025 - Present",
          "stack": "React, TypeScript, Tailwind CSS",
          "bullets": [
            "Created meeting materials and stakeholder-ready summaries using Outlook, Word, and PowerPoint, translating progress and impact metrics into concise updates for partners",
            "Coordinated with the back-end team on API contracts and integration planning; produced maintainability documentation and clear status updates for both technical and non-technical stakeholders",
            "Led a 4-person team and facilitated 2-3 weekly Scrum meetings; tracked action items and deliverables with strong personal accountability"
          ]
        },
        {
          "name": "TechNova",
          "title": "Co-Founder & VP Technical",
          "dates": "Feb 2025 - Present",
          "stack": "React, JavaScript, Python, SQL",
          "bullets": [
            "Supported documentation management and meeting preparation by creating structured notes, action-item tracking, and stakeholder-facing materials using Excel/PowerPoint",
            "Led a 4-person team through Agile sprints using Git and code reviews; upheld strong attention to detail and persistence to deliver independently-owned workstreams on time"
          ]
        },
        {
          "name": "Agrius IT",
          "title": "Software Developer Intern",
          "dates": "May 2024 - Jul 2024",
          "stack": "Python, SQL, JavaScript",
          "bullets": [
            "Documented workflows and contributed to internal SOPs for issue resolution and system operations using Word & Excel; ensured accuracy and repeatability of procedures",
            "Facilitated cross-functional collaboration to troubleshoot and deliver updates, resolving three critical system bottlenecks ahead of schedule"
          ]
        }
      ]
    },
    {
      "company": "City of Calgary",
      "companySlug": "city-of-calgary/cybersecurity-student",
      "title": "Cybersecurity Student",
      "topSkills": ["Security & Access Control", "SOPs & UAT Testing", "Azure AD & Graph API", "Power Automate", "CI/CD & DevOps"],
      "pitch": "I've implemented security-focused backend features including RBAC, CORS policies, and OAuth2 authentication for apps serving 1,000+ daily users. I've also written SOPs, contributed to documentation workflows, and integrated Azure AD with Microsoft Graph API for secure file I/O. I'm excited to bring that hands-on security and documentation experience to the City of Calgary's cybersecurity team.",
      "resumePath": "/Zohair_Omar_Resume_CityOfCalgary_Cybersec_0305.pdf",
      "relevantHighlights": ["Secure Backend Development", "Power Automate, Azure AD & SharePoint Integration", "CI/CD Pipelines & Agile Delivery"],
      "relevantProjects": ["incident-command", "ubc-thrifty-grocers", "production-analytics-forecasting-dashboard"],
      "tailoredExperience": [
        {
          "name": "Enactus UCalgary - WealthPath",
          "title": "Front-End Development Lead",
          "dates": "Jul 2025 - Present",
          "stack": "React, TypeScript, GitHub Actions",
          "bullets": [
            "Implemented a CI/CD pipeline with GitHub Actions for automated testing and quality checks; supported 30+ successful merges without regression",
            "Coordinated with the back-end team on API contracts and integration planning; produced maintainability documentation and clear status updates for stakeholders",
            "Created meeting materials and stakeholder-ready summaries using Outlook, Word, and PowerPoint"
          ]
        },
        {
          "name": "TechNova",
          "title": "Co-Founder & VP Technical",
          "dates": "Feb 2025 - Present",
          "stack": "React, Python, SQL, Git",
          "bullets": [
            "Implemented user login and authentication systems supporting 100+ users, emphasizing secure access and reliable user experience",
            "Supported documentation management and meeting preparation by creating structured notes and stakeholder-facing materials using Excel/PowerPoint"
          ]
        },
        {
          "name": "Agrius IT",
          "title": "Software Developer Intern",
          "dates": "May 2024 - Jul 2024",
          "stack": "Python, SQL, JavaScript",
          "bullets": [
            "Fortified web application security by integrating CORS, proxy settings, and robust error handling while maintaining uninterrupted access for 1,000+ daily users",
            "Developed secure backend functionality including user authentication and role-based access control (RBAC) using SQL to enforce least-privilege access",
            "Documented workflows and contributed to internal SOPs for issue resolution and system operations using Word & Excel"
          ]
        }
      ]
    },
    {
      "company": "City of Calgary",
      "companySlug": "city-of-calgary/automation-student",
      "title": "Automation Developer Student",
      "topSkills": ["RPA & Power Automate", "UAT & Test Documentation", "Documentation Repositories", "Office 365", "Agile/Scrum"],
      "pitch": "I've designed and tested automation workflows in Power Automate with scope-based error handling, integrated Azure AD and Microsoft Graph API for SharePoint file I/O, and maintained documentation repositories with SOPs, meeting notes, and status logs. I'm collaborative and feedback-driven, and I'm excited to learn and grow with the City of Calgary's automation team while contributing reliable, well-documented work from day one.",
      "resumePath": "/Zohair_Omar_Resume_CityOfCalgary_AutomationDev_0207.pdf",
      "relevantHighlights": ["Power Automate, Azure AD & SharePoint Integration", "Data Analysis & KPI Reporting", "CI/CD Pipelines & Agile Delivery"],
      "relevantProjects": ["ticket-triage-rag-bot", "production-analytics-forecasting-dashboard", "oil-gas-asset-integrity-dashboard"],
      "projectsAboveExperience": true,
      "tailoredExperience": [
        {
          "name": "Enactus UCalgary - WealthPath",
          "title": "Front-End Development Lead",
          "dates": "Jul 2025 - Present",
          "stack": "Word, PowerPoint, React, TypeScript",
          "bullets": [
            "Led a 4-person team and facilitated 2-3 Scrum meetings per week; tracked action items, priorities, and deadlines with strong personal accountability",
            "Produced stakeholder-ready updates using Outlook, Word, and PowerPoint, communicating progress and impact metrics clearly to non-technical partners",
            "Supported UAT-style acceptance checks for releases and maintained documentation repositories (meeting notes, decisions, and status logs)"
          ]
        },
        {
          "name": "TechNova",
          "title": "Co-Founder & VP Technical",
          "dates": "Feb 2025 - Present",
          "stack": "React, Python, SQL, Excel, PowerPoint",
          "bullets": [
            "Helped student clubs move from manual tracking to web-based tools; built dashboards and structured workflows for 100+ users",
            "Created structured notes, action-item trackers, and recommendation documents in Excel/PowerPoint to support decisions as priorities changed"
          ]
        },
        {
          "name": "Agrius IT",
          "title": "Software Developer Intern",
          "dates": "May 2024 - Jul 2024",
          "stack": "Python, SQL, Word, Excel",
          "bullets": [
            "Developed and debugged backend features using Python and SQL, improving reliability and supporting secure system operations",
            "Documented workflows and contributed to internal SOPs for issue resolution and system operations using Office 365 (Word, Excel)",
            "Facilitated cross-functional troubleshooting and delivered feature updates, resolving three critical system bottlenecks ahead of schedule"
          ]
        }
      ]
    },
    {
      "company": "City of Calgary",
      "companySlug": "city-of-calgary/pmis-student",
      "title": "Project Management Information Systems Summer Student",
      "topSkills": ["Microsoft Project Server Professional", "Training & Learning Solutions", "Project Documentation", "Change & Transition Management", "Office 365"],
      "pitch": "I've led multi-stakeholder IT projects through Scrum-style delivery, built training materials and onboarding guides for 100+ users, and maintained documentation repositories with SOPs, meeting notes, and status logs. I also have hands-on experience with Microsoft Project Server Professional, Power BI dashboards, and feasibility-style assessments. I'm excited to bring that project coordination, documentation, and change management experience to the City of Calgary's PMIS team.",
      "resumePath": "/Zohair_Omar_Resume_CityOfCalgary_PMIS_0207.pdf",
      "relevantHighlights": ["CI/CD Pipelines & Agile Delivery", "Power Automate, Azure AD & SharePoint Integration", "Data Analysis & KPI Reporting"],
      "relevantProjects": ["production-analytics-forecasting-dashboard", "oil-gas-asset-integrity-dashboard", "business-tracking-application"],
      "tailoredExperience": [
        {
          "name": "Enactus UCalgary - WealthPath",
          "title": "Front-End Development Lead",
          "dates": "Jul 2025 - Present",
          "stack": "Outlook, Word, PowerPoint, React, TypeScript, GitHub Actions",
          "bullets": [
            "Led a 4-person team and facilitated 2-3 Scrum meetings weekly; translated project deliverables into clear action items, timelines, and stakeholder-ready updates",
            "Facilitated partner discussions to confirm scope and objectives, track issues, and drive resolution through clear owners and timelines",
            "Prepared and delivered progress updates and recommendations using Word/PowerPoint, communicating metrics and changes clearly to non-technical stakeholders",
            "Maintained documentation repositories (decisions, meeting notes, status logs) to support transition, onboarding, and consistent execution"
          ]
        },
        {
          "name": "TechNova",
          "title": "Co-Founder & VP Technical",
          "dates": "Feb 2025 - Present",
          "stack": "Power BI, Excel, PowerPoint, React, Python, SQL, Git",
          "bullets": [
            "Identified client needs by gathering requirements and clarifying workflows with stakeholders; documented scope and expectations into actionable deliverables",
            "Built Power BI dashboards and structured reports to track KPIs and communicate outcomes to non-technical audiences; improved access to information for 100+ users",
            "Led development of business-specific learning materials (how-to guides, onboarding docs, walkthroughs) and supported rollout/change adoption across 100+ users by standardizing workflows",
            "Conducted feasibility-style assessments (effort, impact, risks, and adoption considerations) and documented recommendations to support implementation decisions"
          ]
        },
        {
          "name": "Agrius IT",
          "title": "Software Developer Intern",
          "dates": "May 2024 - Jul 2024",
          "stack": "Microsoft Project Server Professional, Outlook, Word, Excel, Python, SQL",
          "bullets": [
            "Supported project planning and execution using Microsoft Project Server Professional, tracking tasks, dependencies, and status to keep delivery on schedule",
            "Prepared project and technology documentation (SOPs, workflow notes, status summaries) and maintained version-controlled records for audit-ready reporting",
            "Facilitated cross-functional issue resolution and communicated progress through structured updates; resolved three critical system bottlenecks ahead of schedule"
          ]
        }
      ]
    },
    {
      "company": "City of Calgary",
      "companySlug": "city-of-calgary/swe-student",
      "title": "Software Developer Summer Student",
      "topSkills": ["Java & JavaScript", "CI/CD & Testing (Jenkins)", "SQL & Databases", "Code Quality & Maintenance", "Microsoft Office"],
      "pitch": "I've built full-stack applications using JavaScript, React, Python, and SQL, and maintained code quality by testing for efficiency and functionality in CI pipelines with GitHub Actions and Jenkins across 30+ merges without regression. I've also written SQL queries to power dashboards and features, and developed secure backend functionality with authentication and RBAC. I'm excited to bring that hands-on coding, testing discipline, and SQL experience to the City of Calgary's software development team.",
      "resumePath": "/Zohair_Omar_Resume_CityOfCalgary_SWE_0208.pdf",
      "relevantHighlights": ["OOP, Java & Full-Stack Architecture", "React, APIs & Full-Stack Development", "CI/CD Pipelines & Agile Delivery", "Secure Backend Development"],
      "relevantProjects": ["incident-command", "ubc-thrifty-grocers", "production-analytics-forecasting-dashboard"],
      "tailoredExperience": [
        {
          "name": "Enactus UCalgary - WealthPath",
          "title": "Front-End Development Lead",
          "dates": "Jul 2025 - Present",
          "stack": "Git, Jenkins, TypeScript, CI/CD, React",
          "bullets": [
            "Led a 4-person team and facilitated 2-3 Scrum meetings per week; communicated clearly, learned fast, and tracked deliverables with high attention to detail",
            "Built a reusable React/TypeScript component library used across 5+ core pages, reducing duplicate code by 20%",
            "Maintained code quality by testing code for efficiency and functionality in CI pipelines (GitHub Actions, Jenkins); supported 30+ merges without regression",
            "Coordinated with back-end developers to define API contracts and resolve integration issues, applying critical thinking to accelerate delivery by 1-2 sprints"
          ]
        },
        {
          "name": "TechNova",
          "title": "Co-Founder & VP Technical",
          "dates": "Feb 2025 - Present",
          "stack": "Jenkins, JavaScript, Git, React, Python, SQL",
          "bullets": [
            "Built full-stack websites and dashboards for student clubs using React, Python, and SQL, improving usability for 100+ users through clear communication and attention to detail",
            "Maintained code quality by testing code for efficiency and functionality and using Git-based workflows with CI (GitHub, Jenkins) to improve release reliability",
            "Produced documentation and onboarding guides that reduced ramp-up time and helped teams learn fast while keeping systems maintainable"
          ]
        },
        {
          "name": "Agrius IT",
          "title": "Software Developer Intern",
          "dates": "May 2024 - Jul 2024",
          "stack": "JavaScript, Jenkins, Python, SQL, HTML/CSS",
          "bullets": [
            "Fortified application security using CORS, proxy settings, and robust error handling while maintaining access for 1,000+ daily users with high attention to detail",
            "Developed and debugged secure backend functionality including authentication and role-based access control using SQL; applied critical thinking to resolve issues quickly",
            "Tested code for efficiency and functionality within CI workflows (Jenkins) and supported feature releases; resolved 3 critical bottlenecks ahead of schedule through strong communication"
          ]
        }
      ]
    },
    {
      "company": "City of Calgary",
      "companySlug": "city-of-calgary/information-management-student",
      "title": "Information Management Student",
      "topSkills": ["SharePoint & Repository Management", "Microsoft Office (Word & Excel)", "Process Documentation & SOPs", "Power Automate & Azure AD", "Organization & Time Management"],
      "pitch": "I've maintained documentation repositories with SOPs, meeting notes, and status logs, integrated SharePoint file I/O via Azure AD and Microsoft Graph API, and built Power Automate workflows for automated reporting. I care about keeping information organized, accurate, and easy for teams to find and trust. I'm excited to bring that repository experience and documentation discipline to the City of Calgary's Water Services information management team.",
      "resumePath": "/Zohair_Omar_Resume_CityOfCalgary_IMS_0209.pdf",
      "relevantHighlights": ["Power Automate, Azure AD & SharePoint Integration", "Data Analysis & KPI Reporting", "CI/CD Pipelines & Agile Delivery"],
      "relevantProjects": ["production-analytics-forecasting-dashboard", "oil-gas-asset-integrity-dashboard", "business-tracking-application"],
      "tailoredExperience": [
        {
          "name": "Enactus UCalgary - WealthPath",
          "title": "Front-End Development Lead",
          "dates": "Jul 2025 - Present",
          "stack": "Word, PowerPoint, React, TypeScript, GitHub Actions",
          "bullets": [
            "Led a 4-person team and facilitated 2-3 Scrum meetings weekly; tracked deliverables, owners, and timelines with strong organization and attention to detail",
            "Produced clear updates and documentation for technical and non-technical stakeholders using Word/PowerPoint",
            "Coordinated with back-end developers to define API contracts and resolve issues, accelerating delivery by 1-2 sprints"
          ]
        },
        {
          "name": "TechNova",
          "title": "Co-Founder & VP Technical",
          "dates": "Feb 2025 - Present",
          "stack": "React, Python, SQL, Git",
          "bullets": [
            "Gathered requirements from student club stakeholders and translated needs into trackable deliverables; maintained documentation and onboarding guides for long-term upkeep",
            "Built full-stack sites and dashboards that improved information access and usability for 100+ users; ensured changes were documented and repeatable",
            "Led a 4-person team through Agile sprints and reviews, balancing priorities and delivering reliable workstreams on schedule"
          ]
        },
        {
          "name": "Agrius IT",
          "title": "Software Developer Intern",
          "dates": "May 2024 - Jul 2024",
          "stack": "Python, SQL, Word, Excel",
          "bullets": [
            "Documented workflows and contributed to internal SOPs for issue resolution and system operations using Word/Excel",
            "Supported reliable operations by troubleshooting and delivering updates; resolved 3 critical system bottlenecks ahead of schedule",
            "Developed backend functionality using Python and SQL, strengthening data integrity and secure access patterns"
          ]
        }
      ]
    },
    {
      "company": "City of Calgary",
      "companySlug": "city-of-calgary/it-ops-euc-student",
      "title": "IT Operations End User Computing Summer Student",
      "topSkills": ["Azure Automation & PowerShell", "CI/CD & GitHub", "KQL Reporting & Analysis", "Endpoint Security & Compliance", "Documentation & Procedures"],
      "pitch": "I've built CI/CD pipelines with GitHub Actions, developed PowerShell scripts for automated deployments, integrated Azure AD and Microsoft Graph API with SharePoint, and written KQL queries for reporting and troubleshooting. I also have hands-on experience hardening web apps with CORS, RBAC, and proxy configurations for 1,000+ users. I'm excited to bring that Azure automation, endpoint security, and documentation experience to the City of Calgary's IT Operations EUC team.",
      "resumePath": "/Zohair_Omar_Resume_CityOfCalgary_IT_OPS_EUC_0209.pdf",
      "relevantHighlights": ["Power Automate, Azure AD & SharePoint Integration", "CI/CD Pipelines & Agile Delivery", "Secure Backend Development"],
      "relevantProjects": ["ticket-triage-rag-bot", "production-analytics-forecasting-dashboard", "oil-gas-asset-integrity-dashboard"],
      "tailoredExperience": [
        {
          "name": "Enactus UCalgary - WealthPath",
          "title": "Front-End Development Lead",
          "dates": "Jul 2025 - Present",
          "stack": "React, TypeScript, GitHub Actions, CI/CD",
          "bullets": [
            "Led a 4-person team and facilitated 2-3 Scrum meetings weekly; maintained high attention to detail while tracking deliverables, owners, and timelines",
            "Implemented CI/CD with GitHub Actions to test code for functionality and prevent regressions; supported 30+ merges without regression",
            "Coordinated with back-end developers on API contracts and integration troubleshooting, applying critical thinking to accelerate delivery by 1-2 sprints",
            "Produced clear stakeholder documentation and procedure-style updates using Word/PowerPoint/Outlook, communicating changes and next steps effectively"
          ]
        },
        {
          "name": "TechNova",
          "title": "Co-Founder & VP Technical",
          "dates": "Feb 2025 - Present",
          "stack": "PowerShell, React, Python, SQL, Git, CI/CD",
          "bullets": [
            "Built full-stack websites and dashboards for clubs using React, Python, and SQL, improving usability and information access for 100+ users",
            "Developed PowerShell scripts to automate repeatable setup/maintenance tasks, improving consistency and reducing manual steps during deployments and troubleshooting",
            "Led a 4-person team using Git branching and code reviews; tested features for functionality and maintained code quality across releases",
            "Created documentation and onboarding guides to standardize workflows and improve long-term maintainability and service delivery"
          ]
        },
        {
          "name": "Agrius IT",
          "title": "Software Developer Intern",
          "dates": "May 2024 - Jul 2024",
          "stack": "KQL, Python, SQL, CI/CD, Web Security",
          "bullets": [
            "Fortified application security using CORS, proxy settings, and robust error handling while maintaining access for 1,000+ daily users",
            "Developed secure backend functionality including authentication and role-based access control (RBAC) using SQL to enforce least-privilege access",
            "Wrote basic KQL queries to support reporting and troubleshooting by investigating patterns during operational follow-ups and validating observed issues",
            "Documented workflows and contributed to internal SOPs for issue resolution and operations using Word; resolved 3 critical bottlenecks ahead of schedule"
          ]
        }
      ]
    },
    {
      "company": "City of Calgary",
      "companySlug": "city-of-calgary/it-ops-am-student",
      "title": "IT Operations Asset Management Summer Student",
      "topSkills": ["Power BI & Asset Reporting", "PowerShell & Azure Automation", "KQL & Operational Analysis", "SharePoint & Documentation", "Endpoint & Device Management"],
      "pitch": "I've built Power BI dashboards tracking operational integrity KPIs with DAX and role-based views, written KQL queries for reporting and anomaly validation, and integrated Azure AD with Microsoft Graph API for SharePoint file I/O. I also have experience automating tasks with PowerShell and documenting workflows with SOPs and procedures. I'm excited to bring that asset reporting, automation, and documentation experience to the City of Calgary's IT Operations Asset Management team.",
      "resumePath": "/Zohair_Omar_Resume_CityOfCalgary_IT_OPS_AM_0209.pdf",
      "relevantHighlights": ["Data Analysis & KPI Reporting", "Power Automate, Azure AD & SharePoint Integration", "CI/CD Pipelines & Agile Delivery"],
      "relevantProjects": ["oil-gas-asset-integrity-dashboard", "production-analytics-forecasting-dashboard", "business-tracking-application"],
      "tailoredExperience": [
        {
          "name": "Enactus UCalgary - WealthPath",
          "title": "Front-End Development Lead",
          "dates": "Jul 2025 - Present",
          "stack": "React, TypeScript, GitHub Actions, CI/CD",
          "bullets": [
            "Led a 4-person team and facilitated 2-3 Scrum meetings weekly; maintained detailed action tracking and clear communication across stakeholders",
            "Implemented CI/CD with GitHub Actions to test changes for functionality and prevent regressions; supported 30+ merges without regression",
            "Coordinated with back-end developers to resolve integration issues and improve delivery by 1-2 sprints through structured problem solving",
            "Produced stakeholder-ready updates and documentation using Outlook/Word/PowerPoint, translating technical progress into concise status reporting"
          ]
        },
        {
          "name": "TechNova",
          "title": "Co-Founder & VP Technical",
          "dates": "Feb 2025 - Present",
          "stack": "PowerShell, React, Python, SQL, Git",
          "bullets": [
            "Built full-stack websites and dashboards for clubs, improving information access and usability for 100+ users through organized delivery",
            "Used PowerShell to automate repeatable setup/maintenance tasks, improving consistency and reducing manual steps during troubleshooting",
            "Created onboarding guides and process documentation to standardize workflows and improve service quality over time"
          ]
        },
        {
          "name": "Agrius IT",
          "title": "Software Developer Intern",
          "dates": "May 2024 - Jul 2024",
          "stack": "KQL, Python, SQL, Web Security",
          "bullets": [
            "Strengthened security and reliability using CORS, proxy settings, and robust error handling while maintaining access for 1,000+ daily users",
            "Developed backend authentication and RBAC using SQL to enforce least-privilege access and improve compliance-minded operations",
            "Wrote basic KQL queries to support analysis and reporting during operational follow-ups, validating patterns and anomalies",
            "Documented workflows and contributed to internal SOPs for issue resolution; resolved 3 critical bottlenecks ahead of schedule"
          ]
        }
      ]
    },
    {
      "company": "ATCO",
      "companySlug": "atco/ai-automation",
      "title": "AI & Automation Co-op Student",
      "topSkills": ["Power Automate & Workflow Automation", "Python & RAG Patterns", "Azure AD & API Integration", "CI/CD & Automated Testing", "Dashboard & Reporting Tools"],
      "pitch": "I've built AI-assisted workflows including a RAG-based ticket triage bot with multi-provider routing (OpenAI, Gemini), designed Power Automate workflows with scope-based error handling, and integrated Azure AD with Microsoft Graph API for SharePoint automation. I also have strong CI/CD and testing discipline with 34 automated tests and 30+ regression-free merges. I'm eager to apply that automation and AI experience to ATCO's digital transformation initiatives.",
      "resumePath": "/Zohair_Omar_Resume_ATCO_AIAutomation_0212.pdf",
      "relevantHighlights": ["Power Automate, Azure AD & SharePoint Integration", "Data Analysis & KPI Reporting", "CI/CD Pipelines & Agile Delivery"],
      "relevantProjects": ["ticket-triage-rag-bot", "production-analytics-forecasting-dashboard", "ubc-thrifty-grocers"],
      "projectsAboveExperience": true,
      "tailoredExperience": [
        {
          "name": "Enactus UCalgary - WealthPath",
          "title": "Front-End Development Lead",
          "dates": "Jul 2025 - Present",
          "stack": "React, TypeScript, GitHub Actions, CI/CD",
          "bullets": [
            "Led a 4-person team and facilitated 2-3 Scrum meetings weekly; tracked action items and deliverables with high attention to detail and clear communication",
            "Implemented CI/CD with GitHub Actions (linting and tests per PR), supporting 30+ successful merges without regression",
            "Coordinated API contracts with back-end teammates, resolved integration issues, and maintained documentation to speed delivery by 1-2 sprints"
          ]
        },
        {
          "name": "Agrius IT",
          "title": "Software Developer Intern",
          "dates": "May 2024 - Jul 2024",
          "stack": "Python, SQL, Web Security",
          "bullets": [
            "Fortified web application security using CORS, proxy settings, and robust error handling, supporting uninterrupted access for 1,000+ daily users",
            "Developed secure backend functionality including authentication and RBAC using SQL to enforce least-privilege access",
            "Documented workflows and SOPs for issue resolution and system operations; collaborated cross-functionally to resolve three critical bottlenecks ahead of schedule"
          ]
        }
      ]
    },
    {
      "company": "ATCO",
      "companySlug": "atco/erp-scm-student",
      "title": "ERP & SCM Support Analyst Co-op Student",
      "topSkills": ["Incident Triage & Troubleshooting", "SQL & Data Reporting", "ITIL-Aligned Support", "Process Documentation (SOPs/KB)", "CI/CD & Release Discipline"],
      "pitch": "I've supported production applications by troubleshooting incidents, strengthening authentication and RBAC flows with SQL, and creating SOP-style documentation for faster resolution handoffs. I've also built reporting dashboards in Power BI and automated distribution workflows with Power Automate. I'm excited to bring that service delivery, documentation, and reporting experience to ATCO's ERP/SCM support team and grow my skills in Oracle Fusion.",
      "resumePath": "/Zohair_Omar_Resume_ATCO_ERPSCM_0211.pdf",
      "relevantHighlights": ["Data Analysis & KPI Reporting", "Secure Backend Development", "Power Automate, Azure AD & SharePoint Integration"],
      "relevantProjects": ["incident-command", "ticket-triage-rag-bot", "oil-gas-asset-integrity-dashboard"],
      "tailoredExperience": [
        {
          "name": "Agrius IT",
          "title": "Software Developer Intern (Application Support & Reliability)",
          "dates": "May 2024 - Jul 2024",
          "stack": "Python, SQL",
          "bullets": [
            "Supported day-to-day operations of a production web application by troubleshooting incidents and improving reliability via stronger error handling and CORS/proxy configuration, supporting 1,000+ daily users",
            "Investigated access issues and strengthened authentication/RBAC flows using SQL-backed logic, improving correctness and reducing recurring support tickets",
            "Created SOP-style documentation for common issues and resolution steps, enabling faster handoffs and more consistent incident resolution"
          ]
        },
        {
          "name": "Enactus UCalgary - WealthPath",
          "title": "Front-End Development Lead",
          "dates": "Jul 2025 - Present",
          "stack": "React, TypeScript",
          "bullets": [
            "Coordinated a 4-person team to deliver a platform for Alberta students by translating stakeholder needs into tracked work items, timelines, and deploy-ready deliverables",
            "Reduced integration issues by defining API contracts and resolving cross-team defects early, improving turnaround time by 1-2 sprints",
            "Improved release quality using CI checks on every pull request (GitHub Actions), supporting 30+ changes with consistent validation"
          ]
        },
        {
          "name": "TechNova",
          "title": "Co-Founder & VP Technical",
          "dates": "Feb 2025 - Present",
          "stack": "Python, SQL",
          "bullets": [
            "Delivered internal web tools and dashboards that reduced manual tracking and improved visibility into operational workflows for 100+ users",
            "Documented onboarding and support runbooks to improve continuity and reduce time-to-resolution for recurring issues"
          ]
        }
      ]
    },
    {
      "company": "ATCO",
      "companySlug": "atco/solution-architecture-student",
      "title": "IT Solution Architecture Co-op Student",
      "topSkills": ["Architecture Documentation (Visio/PPT)", "SharePoint & Repository Management", "Power BI & Stakeholder Reporting", "Process Improvement & Templates", "Cross-Functional Communication"],
      "pitch": "I've created and maintained architecture-style artifacts in Visio and PowerPoint (component diagrams, data flows, integration notes), built documentation systems with SharePoint folder conventions and templates that reduced repeat questions by 25%, and produced stakeholder-facing dashboards in Power BI. I care about documentation accuracy, standardized deliverables, and clear communication. I'm excited to support ATCO's solution architecture team with that structured, detail-oriented approach.",
      "resumePath": "/Zohair_Omar_Resume_ATCO_ITSolution_0212.pdf",
      "relevantHighlights": ["Power Automate, Azure AD & SharePoint Integration", "Data Analysis & KPI Reporting", "CI/CD Pipelines & Agile Delivery"],
      "relevantProjects": ["oil-gas-asset-integrity-dashboard", "production-analytics-forecasting-dashboard"],
      "tailoredExperience": [
        {
          "name": "Enactus UCalgary - WealthPath",
          "title": "Front-End Development Lead",
          "dates": "Jul 2025 - Present",
          "stack": "React, TypeScript, Tailwind CSS, Visio, PowerPoint, Office Suite",
          "bullets": [
            "Led a 4-person team and facilitated 2-3 weekly Scrum meetings; maintained action-item tracking in Excel/Outlook and delivered weekly updates to partners, improving follow-through and reducing missed handoffs",
            "Created and maintained architecture-style artifacts in Visio/PowerPoint (component diagrams, data flows, integration notes), aligning stakeholders and reducing rework during handoffs by 20%",
            "Coordinated with back-end stakeholders to capture integration requirements and record decisions (assumptions, constraints, next steps) in structured Word decision logs, improving onboarding speed for new contributors",
            "Implemented CI/CD with GitHub Actions to standardize quality checks and improve review consistency across 30+ merged changes"
          ]
        },
        {
          "name": "TechNova",
          "title": "Co-Founder & VP Technical",
          "dates": "Feb 2025 - Present",
          "stack": "SharePoint, Power BI, PowerPoint, Excel, Git",
          "bullets": [
            "Gathered requirements from non-technical stakeholders and translated needs into deliverables; documented scope, risks, and dependencies in Word/Excel to keep delivery predictable",
            "Built and maintained a lightweight documentation system (templates, checklists, and SharePoint folder conventions) to standardize handoffs and reduce repeat questions by 25%",
            "Built stakeholder-facing dashboards and summaries using Power BI and PowerPoint, enabling faster status visibility and more consistent reporting across projects",
            "Assessed solution options and documented recommendations by comparing effort, impact, and delivery tradeoffs to support implementation decisions"
          ]
        },
        {
          "name": "Agrius IT",
          "title": "Software Developer Intern",
          "dates": "May 2024 - Jul 2024",
          "stack": "Office 365 (Word, Excel, PowerPoint), SharePoint",
          "bullets": [
            "Reviewed existing technical documentation for accuracy and completeness; improved SOP clarity by adding step-by-step procedures and edge-case notes, reducing avoidable escalations by 15%",
            "Supported repository organization and version control for operational documents (Word/Excel) and status materials (PowerPoint), ensuring teams could quickly locate current procedures and references",
            "Collaborated across teams to troubleshoot incidents and document resolutions, improving repeatability and reducing turnaround time on recurring issues"
          ]
        }
      ]
    },
    {
      "company": "Precision Drilling",
      "companySlug": "precision-drilling/ai-innovation-analyst-intern",
      "title": "AI Innovation Analyst Intern",
      "topSkills": ["AI Research & Evaluation", "Python & Cloud AI Services", "Data Preparation & QA", "Documentation & AI Governance", "Chatbot & Agent Development"],
      "pitch": "I've built AI-assisted workflows including a RAG-based ticket triage bot with multi-provider routing, designed Power Automate workflows with scope-based error handling, and documented everything with SOPs and runbooks for reliable handoffs. I focus on making outcomes usable, not just technically correct, which fits the role's emphasis on demos, adoption support, and training. I'm excited to support Precision's AI efforts by researching tools, building chatbots, and turning validated use cases into deployable workflows.",
      "resumePath": "/Zohair_Omar_Resume_Precision_AIInnovation_0213.pdf",
      "relevantHighlights": ["Power Automate, Azure AD & SharePoint Integration", "Data Analysis & KPI Reporting", "CI/CD Pipelines & Agile Delivery"],
      "relevantProjects": ["ticket-triage-rag-bot", "production-analytics-forecasting-dashboard", "oil-gas-asset-integrity-dashboard"],
      "projectsAboveExperience": true,
      "tailoredExperience": [
        {
          "name": "TechNova",
          "title": "Co-Founder & VP Technical",
          "dates": "Feb 2025 - Present",
          "stack": "Python, JavaScript, Git",
          "bullets": [
            "Gathered requirements from non-technical stakeholders and translated needs into shipped tools/features, iterating quickly based on feedback",
            "Delivered internal-facing solutions with clear documentation and walkthroughs to support adoption and reduce repeat support questions"
          ]
        },
        {
          "name": "Agrius IT",
          "title": "Software Developer Intern",
          "dates": "May 2024 - Jul 2024",
          "stack": "Python, SQL",
          "bullets": [
            "Supported troubleshooting and analysis by writing/refining SQL queries to retrieve and validate operational data; summarized findings for faster issue resolution",
            "Improved SOP clarity and repeatability by documenting resolutions and edge cases for recurring system and data issues"
          ]
        },
        {
          "name": "Enactus UCalgary - WealthPath",
          "title": "Front-End Development Lead",
          "dates": "Jul 2025 - Present",
          "stack": "Agile/Scrum, stakeholder delivery",
          "bullets": [
            "Led a 4-person team through iterative delivery and cross-functional collaboration; maintained issue tracking and clear status updates under deadlines",
            "Standardized review quality using CI checks (GitHub Actions), supporting stable releases while the product evolved with partner feedback"
          ]
        }
      ]
    },
    {
      "company": "Precision Drilling",
      "companySlug": "precision-drilling/infrastructure-services-intern",
      "title": "Infrastructure Services, Systems & Storage Intern",
      "topSkills": ["Azure & Active Directory", "PowerShell & Scripting", "Endpoint Management", "Documentation & Change Control", "Core Networking (TCP/IP, DNS, DHCP)"],
      "pitch": "I've built CI/CD pipelines with GitHub Actions, developed PowerShell scripts for automated deployments, integrated Azure AD with Microsoft Graph API, and hardened web apps with CORS, RBAC, and proxy configurations for 1,000+ users. I also have strong documentation habits with SOPs, runbooks, and validation steps. I'm excited to support Precision's infrastructure services, contribute to endpoint sustainment work, and learn deeply from the senior analysts.",
      "resumePath": "/Zohair_Omar_Resume_Precision_InfraServices_0213.pdf",
      "relevantHighlights": ["Secure Backend Development", "Power Automate, Azure AD & SharePoint Integration", "CI/CD Pipelines & Agile Delivery"],
      "relevantProjects": ["production-analytics-forecasting-dashboard", "ubc-thrifty-grocers", "oil-gas-asset-integrity-dashboard"],
      "tailoredExperience": [
        {
          "name": "TechNova",
          "title": "Co-Founder & VP Technical",
          "dates": "Feb 2025 - Present",
          "stack": "PowerShell, Python, SQL, Git",
          "bullets": [
            "Automated repetitive operational tasks using PowerShell and lightweight scripts; improved consistency of setup/maintenance steps while reducing manual effort",
            "Built data-backed functionality using Python and SQL; validated outputs with structured checks to ensure reliable behavior under changing requirements",
            "Created runbooks and onboarding documentation to support stable handoffs and reduce repeat support requests across internal users"
          ]
        },
        {
          "name": "Agrius IT",
          "title": "Software Developer Intern",
          "dates": "May 2024 - Jul 2024",
          "stack": "Python, SQL, HTML/CSS, JavaScript",
          "bullets": [
            "Supported troubleshooting by writing/refining SQL queries to retrieve and validate operational data; summarized findings to accelerate incident resolution",
            "Strengthened stability by improving error handling and documenting repeatable resolution steps (SOPs/runbooks) with attention to change discipline"
          ]
        },
        {
          "name": "Enactus UCalgary - WealthPath",
          "title": "Front-End Development Lead",
          "dates": "Jul 2025 - Present",
          "stack": "GitHub Actions, Agile/Scrum",
          "bullets": [
            "Led a 4-person team delivering iterative releases; tracked issues/action items and collaborated cross-functionally to meet deadlines",
            "Implemented CI/CD checks with GitHub Actions to standardize build/test validation and reduce regressions, improving release reliability"
          ]
        }
      ]
    },
    {
      "company": "Precision Drilling",
      "companySlug": "precision-drilling/data-analyst-intern",
      "title": "Data Analyst Intern",
      "topSkills": ["Python & SQL Analytics", "Power BI & Reporting Tables", "Data Validation & QA Checks", "Data Documentation & Mapping Logic", "Requirements Gathering & Collaboration"],
      "pitch": "I've designed reporting tables and clean data models across 24 months of operational data in Power BI, implemented data validation checks (missing values, duplicates, range rules), and documented data definitions and mapping logic so metrics stay transparent as requirements evolve. I also built end-to-end Python workflows that clean, validate, and standardize multi-well production data into analysis-ready datasets. I'm excited to contribute to Alpha by improving accessibility and usability of operational information.",
      "resumePath": "/Zohair_Omar_Resume_Precision_Data_0213.pdf",
      "relevantHighlights": ["Data Analysis & KPI Reporting", "Power Automate, Azure AD & SharePoint Integration", "CI/CD Pipelines & Agile Delivery"],
      "relevantProjects": ["oil-gas-asset-integrity-dashboard", "production-analytics-forecasting-dashboard"],
      "tailoredExperience": [
        {
          "name": "TechNova",
          "title": "Co-Founder & VP Technical",
          "dates": "Feb 2025 - Present",
          "stack": "Python, SQL, Power BI, Git",
          "bullets": [
            "Gathered reporting requirements across stakeholders and translated needs into reporting tables, KPI definitions, and dashboard views to improve accessibility of operational information",
            "Built data-backed functionality using Python and SQL; validated outputs with structured checks to ensure reliable, analysis-ready results",
            "Documented metric logic and data assumptions (definitions, refresh notes, edge cases) to keep reporting transparent as requirements evolved in a fast-paced environment"
          ]
        },
        {
          "name": "Agrius IT",
          "title": "Software Developer Intern",
          "dates": "May 2024 - Jul 2024",
          "stack": "Python, SQL, HTML/CSS, JavaScript",
          "bullets": [
            "Wrote and refined SQL queries to retrieve, validate, and reconcile operational data during incident troubleshooting; summarized findings for engineers and support",
            "Updated SOPs with clear steps and validation notes, improving repeatability and supporting faster resolution of recurring data/system issues"
          ]
        },
        {
          "name": "Enactus UCalgary - WealthPath",
          "title": "Front-End Development Lead",
          "dates": "Jul 2025 - Present",
          "stack": "Git, GitHub Actions, Agile/Scrum",
          "bullets": [
            "Coordinated cross-functionally to capture requirements and ship features under deadlines; maintained delivery tracking, action items, and follow-ups with strong accountability",
            "Implemented CI checks with GitHub Actions to reduce regressions and keep releases stable while iterating quickly with stakeholder feedback"
          ]
        }
      ]
    },
    {
      "company": "Precision Drilling",
      "companySlug": "precision-drilling/sap-development-intern",
      "title": "SAP Development Intern",
      "topSkills": ["Python, Java & SQL", "REST APIs & Web Services", "SDLC & Change Control", "Documentation (SOPs/Runbooks)", "CI/CD & Agile Delivery"],
      "pitch": "I've supported operational systems by writing and refining SQL queries, debugging integrations, and maintaining clean handoffs through clear technical notes and reproducible steps. I also gained basic exposure to SAP and integration software through internal walkthroughs at Agrius IT. With strong foundations in Python, Java, REST APIs, and CI/CD, I'm excited to contribute to Precision's SAP team by learning integration technologies, following the SDLC, and delivering reliable solutions under guidance.",
      "resumePath": "/Zohair_Omar_Resume_Precision_SAP_0213.pdf",
      "relevantHighlights": ["OOP, Java & Full-Stack Architecture", "React, APIs & Full-Stack Development", "CI/CD Pipelines & Agile Delivery", "Secure Backend Development"],
      "relevantProjects": ["incident-command", "production-analytics-forecasting-dashboard", "oil-gas-asset-integrity-dashboard"],
      "tailoredExperience": [
        {
          "name": "Agrius IT",
          "title": "Software Developer Intern",
          "dates": "May 2024 - Jul 2024",
          "stack": "Python, SQL, HTML/CSS, JavaScript",
          "bullets": [
            "Supported day-to-day troubleshooting by writing/refining SQL queries to validate operational data, isolate root causes, and summarize findings for faster issue resolution",
            "Contributed to stability improvements by implementing backend changes and debugging integrations; maintained clean handoffs through clear technical notes and reproducible steps",
            "Updated internal SOPs/runbooks with edge cases and validation checks, improving repeatability for recurring incidents and reducing back-and-forth during support",
            "Gained basic exposure to SAP and integration software through internal walkthroughs and shadowing, building familiarity with how enterprise systems exchange data and how changes are controlled"
          ]
        },
        {
          "name": "TechNova",
          "title": "Co-Founder & VP Technical",
          "dates": "Feb 2025 - Present",
          "stack": "Python, SQL, Git",
          "bullets": [
            "Gathered requirements and translated them into implementable deliverables; balanced scope, risks, and timelines to ship reliable features under deadlines",
            "Built data-backed functionality using Python and SQL and validated outputs with structured checks to ensure consistent behavior as requirements evolved",
            "Created onboarding and support documentation (how-to guides, troubleshooting notes, and change summaries) to improve maintainability and reduce repeat support requests"
          ]
        },
        {
          "name": "Enactus UCalgary - WealthPath",
          "title": "Front-End Development Lead",
          "dates": "Jul 2025 - Present",
          "stack": "GitHub Actions, Agile/Scrum",
          "bullets": [
            "Led a 4-person team through iterative delivery (2-3 Scrum meetings/week), incorporating feedback quickly and maintaining clear action tracking",
            "Implemented CI/CD with GitHub Actions to standardize build/test checks, improving release stability while iterating rapidly with stakeholders"
          ]
        }
      ]
    },
    {
      "company": "Health Shared Services",
      "companySlug": "health-shared-services/it-student",
      "title": "Co-op Work Experience Student - IT",
      "topSkills": ["Microsoft 365 & Collaboration Tools", "Python, SQL & Programming", "Power BI & Data Reporting", "Troubleshooting, Documentation & SOPs", "Stakeholder Communication & Customer Support"],
      "pitch": "This role covers broad IT placements - web, support, project, and analyst - and that's the range I've worked across at WealthPath, TechNova, and Agrius IT. I use Microsoft 365 tools daily (Teams, SharePoint, Excel, Visio, Project Server, Word), have built Power BI dashboards with SharePoint and Azure AD integration, and consistently deliver through documentation, troubleshooting, and clear stakeholder communication. I'm available May-August 2026, Alberta-based, and ready to contribute wherever the Health Shared Services IT team needs reliable, adaptable support.",
      "resumePath": "/Zohair_Omar_Resume_AHS_IT_0225.pdf",
      "relevantHighlights": ["Data Analysis & KPI Reporting", "Power Automate, Azure AD & SharePoint Integration", "CI/CD Pipelines & Agile Delivery"],
      "relevantProjects": ["production-analytics-forecasting-dashboard", "oil-gas-asset-integrity-dashboard", "incident-command"],
      "tailoredExperience": [
        {
          "name": "Enactus UCalgary - WealthPath",
          "title": "Front-End Development Lead",
          "dates": "Jul 2025 - Present",
          "stack": "React, TypeScript, Teams, Excel, Word, Visio, PowerPoint",
          "bullets": [
            "Led a 4-person team and facilitated 2-3 weekly Scrum meetings; tracked priorities, risks, and action items using Teams/Excel/Word with strong follow-through",
            "Created architecture-style artifacts in Visio/PowerPoint/Word (component diagrams, integration notes, decision logs) to reduce rework and improve stakeholder clarity",
            "Coordinated with technical and non-technical stakeholders to gather requirements and communicate progress, supporting timely delivery of a pilot used by 100+ students"
          ]
        },
        {
          "name": "TechNova",
          "title": "Co-Founder & VP Technical",
          "dates": "Feb 2025 - Present",
          "stack": "Python, SQL, Power BI, SharePoint, Git",
          "bullets": [
            "Built web solutions and dashboards for clubs; translated user needs into features, reports, and support documentation to improve information access for 100+ users",
            "Developed data-backed functionality using Python/SQL and produced stakeholder-facing reporting views in Power BI, validating outputs for reliable decision support",
            "Created onboarding guides and troubleshooting notes to improve customer support quality and reduce repeat questions during rollout and maintenance"
          ]
        },
        {
          "name": "Agrius IT",
          "title": "Software Developer Intern",
          "dates": "May 2024 - Jul 2024",
          "stack": "Python, SQL, Word, Excel, Project Server",
          "bullets": [
            "Supported troubleshooting and incident follow-up by writing/refining SQL queries to validate data and summarize findings for faster resolution",
            "Documented workflows and contributed to SOPs/runbooks in Word/Excel; improved repeatability and support readiness for recurring operational issues",
            "Collaborated cross-functionally and tracked updates/tasks using project-oriented workflows (Project Server/status notes), resolving 3 critical bottlenecks ahead of schedule"
          ]
        }
      ]
    },
    {
      "company": "Nutrien",
      "companySlug": "nutrien/automation-ai",
      "title": "Automation and AI Co-op",
      "topSkills": ["Python & PowerShell Automation", "CI/CD & DevOps (GitHub Actions, Jenkins)", "AI Workflow Automation", "Monitoring & KPI Dashboards", "Technical Documentation & Runbooks"],
      "pitch": "I've automated operational tasks using Python and PowerShell, built monitoring dashboards and KPI reporting tools used by 100+ users, and maintained CI/CD pipelines that kept 30+ merges regression-free. I also built a production-grade AI ticket triage system using RAG patterns with multi-provider routing between OpenAI and Gemini, exactly the type of AI workflow automation this role is centered on. I'm excited to apply that automation and AI experience at Nutrien while growing in a data-rich, industrial environment.",
      "relevantHighlights": ["Power Automate, Azure AD & SharePoint Integration", "CI/CD Pipelines & Agile Delivery", "Data Analysis & KPI Reporting"],
      "relevantProjects": ["ticket-triage-rag-bot", "production-analytics-forecasting-dashboard", "incident-command"],
      "projectsAboveExperience": true,
      "tailoredExperience": [
        {
          "name": "TechNova",
          "title": "Co-Founder & VP Technical",
          "dates": "Feb 2025 - Present",
          "stack": "Python, PowerShell, SQL, Git",
          "bullets": [
            "Built Python and PowerShell automation scripts to streamline repetitive operational tasks, improving consistency and reducing manual effort for 100+ users",
            "Developed monitoring dashboards and SQL-based reporting views to surface KPIs and support faster issue detection across internal teams",
            "Created self-serve documentation including how-to guides and onboarding materials, enabling independent use and reducing repeat support questions"
          ]
        },
        {
          "name": "Agrius IT",
          "title": "Software Developer Intern",
          "dates": "May 2024 - Jul 2024",
          "stack": "Python, SQL, KQL",
          "bullets": [
            "Wrote Python and SQL scripts to automate data retrieval and validation workflows, improving speed and accuracy during incident troubleshooting",
            "Developed basic KQL queries to support reporting and anomaly investigation; documented findings in structured runbooks for recurring operational issues",
            "Contributed to SOPs and workflow documentation for issue resolution and system operations, improving repeatability across the team"
          ]
        },
        {
          "name": "Enactus UCalgary - WealthPath",
          "title": "Front-End Development Lead",
          "dates": "Jul 2025 - Present",
          "stack": "React, TypeScript, GitHub Actions, CI/CD",
          "bullets": [
            "Led a 4-person team and facilitated 2-3 Scrum meetings weekly; produced handoff documentation and runbooks to support knowledge transfer and consistent delivery",
            "Implemented CI/CD pipeline with GitHub Actions for automated testing and quality checks; supported 30+ successful merges without regression",
            "Coordinated with back-end teammates to define API contracts and resolve integration issues, accelerating feature delivery by 1-2 sprints"
          ]
        }
      ]
    }
  ],
  "genericPitch": "I build full-stack applications and data-driven solutions backed by real metrics. Whether it's Go backends, Power BI dashboards, leading dev teams, or shipping under 24-hour hackathon deadlines, I focus on technical depth, fast learning, and getting things out the door.",
  "highlights": [
    {
      "label": "Power Automate, Azure AD & SharePoint Integration",
      "problem": "Operational teams were manually reviewing time-series data with no automated way to flag anomalies or share forecasts",
      "built": "Analytics dashboard processing real North Sea data (7 wells) with ETS forecasting, 95% confidence intervals, and rolling z-score anomaly detection. Integrated Azure AD (OAuth2) and Microsoft Graph API for SharePoint file I/O with automatic token refresh, plus a Power Automate workflow for weekly report distribution via Outlook",
      "tech": "Python, Streamlit, Azure AD, Microsoft Graph API, Power Automate, SharePoint",
      "impact": "45% lower MAE vs baseline, automated weekly email reporting replaced manual process, dual-mode architecture (cloud/local) for flexible deployment",
      "link": "/scenes#production-analytics-forecasting-dashboard"
    },
    {
      "label": "CI/CD Pipelines & Agile Delivery",
      "problem": "A financial literacy platform needed someone to own front-end architecture and sort out API contracts between the front-end and back-end teams",
      "built": "Led requirements gathering through 2-3 Scrum meetings per week, defined API contracts with the back-end team, built a shared React component library across 5+ pages, and implemented a CI/CD pipeline with GitHub Actions running linting and tests on every PR",
      "tech": "React, TypeScript, Tailwind CSS, GitHub Actions, CI/CD",
      "impact": "Accelerated feature delivery by 1-2 sprints, 30+ successful PR merges without regression, piloted with 100+ students across 2-3 schools",
      "link": null
    },
    {
      "label": "Secure Backend Development",
      "problem": "Web apps serving 1,000+ daily users needed tighter security without breaking anything for active users",
      "built": "Set up CORS policies, proxy configs, role-based access control, and SQL-based authentication. Also documented system workflows and contributed to internal SOPs for issue resolution and operations",
      "tech": "Python, SQL, JavaScript, HTML/CSS",
      "impact": "Zero security incidents during tenure, resolved 3 critical system bottlenecks, all deadlines met ahead of schedule",
      "link": null
    },
    {
      "label": "React, APIs & Full-Stack Development",
      "problem": "Co-founded a dev studio and needed to set up structured delivery practices to ship reliable products for university clubs",
      "built": "Led 4 developers through Agile sprints with Git-based code reviews, shipped login systems, dashboards, and responsive UIs, and wrote documentation and onboarding guides for new contributors",
      "tech": "React, JavaScript, Python, SQL, Git, REST APIs",
      "impact": "100+ active users served, clean deployment pipeline, documentation enabled faster onboarding for new contributors",
      "link": null
    },
    {
      "label": "OOP, Java & Full-Stack Architecture",
      "problem": "Needed to demonstrate end-to-end software engineering across backend, web, and mobile with proper OOP design, testing discipline, and CI/CD",
      "built": "Full-stack incident management platform with a Spring Boot REST API (Strategy pattern escalation engine, JWT + RBAC), React + TypeScript dashboard, and Kotlin Android app with MVVM and offline-first caching. Configured Jenkins and GitHub Actions CI/CD pipelines",
      "tech": "Java, Spring Boot, React, TypeScript, Kotlin, Jetpack Compose, PostgreSQL, Docker, Jenkins",
      "impact": "99 automated tests (JUnit 5 + Mockito), caught real production bugs during testing, 3-platform architecture from a single API",
      "link": "/scenes#incident-command"
    },
    {
      "label": "Data Analysis & KPI Reporting",
      "problem": "Operations teams had no centralized view of asset integrity KPIs, so prioritizing inspections and catching compliance gaps was mostly guesswork",
      "built": "Power BI dashboard with DAX measures, role-based views for engineers vs. managers, slicers by department/month/year, and compliance trend summaries for stakeholder reporting",
      "tech": "Power BI, DAX, Power Query, SQL Server, SharePoint",
      "impact": "24 months of data modeled, backlog alerts enabled proactive planning, role-based access tailored insights per audience",
      "link": "/scenes#oil-gas-asset-integrity-dashboard"
    }
  ],
  "relevantProjects": [
    "production-analytics-forecasting-dashboard",
    "oil-gas-asset-integrity-dashboard",
    "ubc-thrifty-grocers",
    "business-tracking-application"
  ],
  "relevantExperience": [
    "Enactus UCalgary - WealthPath",
    "TechNova",
    "Agrius IT"
  ]
}
