{
  "header": {
    "name": "Zohair Omar",
    "email": "zohairomar@gmail.com",
    "phone": "+1-604-8628753",
    "linkedin": "linkedin.com/in/zohairomar",
    "github": "github.com/zohairomar1"
  },
  "skills": [
    {
      "category": "Programming Languages",
      "items": ["Python", "SQL", "Java", "JavaScript", "HTML/CSS", "C"]
    },
    {
      "category": "Web Development & APIs",
      "items": ["React", "Tailwind CSS", "Flask", "REST APIs", "HTML/CSS", "Postman", "Docker"]
    },
    {
      "category": "Testing & DevOps",
      "items": ["Unit Testing (JUnit5)", "CI/CD (GitHub Actions)", "Version Control (Git)"]
    },
    {
      "category": "Data Analysis & Visualization",
      "items": ["Excel (Pivot Tables, VLOOKUP, Charts)", "Power BI", "Pandas", "Numpy", "Matplotlib"]
    },
    {
      "category": "Developer & Office Tools",
      "items": ["VS Code", "IntelliJ", "PyCharm", "Codenvy", "Microsoft Excel", "Word", "PowerPoint"]
    }
  ],
  "education": [
    {
      "degree": "Bachelor of Science, Computer Science & Mathematics (Minor in Economics)",
      "school": "University of Calgary, Alberta",
      "dates": "Expected December 2026",
      "keyCourses": [
        "Object-Oriented Programming",
        "Data Structures & Algorithms",
        "Functional Programming",
        "Applied Machine Learning (Python)",
        "Introduction to Data Science (R)"
      ]
    },
    {
      "degree": "Bachelor of Science, Computer Science",
      "school": "University of British Columbia, Vancouver",
      "dates": "Sep 2022 - Sep 2024"
    }
  ],
  "experience": [
    {
      "name": "Enactus UCalgary - WealthPath",
      "title": "Front-End Development Lead",
      "stack": "React, TypeScript, Tailwind CSS",
      "location": "Calgary, AB",
      "dates": "Jul 2025 – Present",
      "bullets": [
        "Lead a 4-person front-end team to develop a financial literacy platform for young adults; facilitate 2–3 Scrum meetings per week to align priorities and track deliverables.",
        "Built a reusable React/TypeScript component library adopted across 5+ core pages, reducing duplicate code by approximately 20%.",
        "Coordinated with the back-end team to define API contracts and resolve integration issues, accelerating feature delivery by 1–2 sprints compared to earlier timelines.",
        "Implemented a CI/CD pipeline with GitHub Actions that now runs automated linting and tests on every pull request; supported over 30 successful merges without regression.",
        "Built and deployed the platform pilot through partnerships with 2–3 schools, impacting 100+ students in the first semester."
      ]
    },
    {
      "name": "TechNova",
      "url": "https://v0-tech-websitemain1-vu.vercel.app/",
      "title": "Co-Founder & VP Technical",
      "stack": "React, Javascript, HTML/CSS, Python, SQL, Git",
      "location": "Calgary, AB",
      "dates": "February 2025 – Present",
      "bullets": [
        "Built full-stack websites for clubs using React, Python & SQL, focusing on modular design and maintainability.",
        "Led a team of 4 developers through Agile sprints, leveraging Git and code reviews for clean, testable code.",
        "Implemented user login, responsive UIs, and dashboards to improve functionality & user experience for 100+ users.",
        "Created documentation and onboarding guides to support faster ramp-up and long-term technical system upkeep."
      ]
    },
    {
      "name": "Agrius IT",
      "title": "Software Developer Intern",
      "stack": "Python, SQL, HTML/CSS, JavaScript",
      "location": "Abu Dhabi, UAE",
      "dates": "May 2024 - July 2024",
      "bullets": [
        "Fortified web application security by integrating enterprise-grade security protocols, including CORS, proxy settings, and error handling protocols; directly mitigated risk of cyberattacks while ensuring uninterrupted service for 1,000+ daily users accessing the platform.",
        "Documented workflows and contributed to internal SOPs for issue resolution and system operations using Word.",
        "Facilitated cross-functional collaboration to troubleshoot and deliver feature updates, resolving three critical system bottlenecks and meeting all deadlines ahead of schedule.",
        "Developed and debugged secure backend solutions involving user authentication and role-based access control using SQL, improving database query performance and security."
      ]
    },
    {
      "name": "UBC Design League",
      "title": "Software Developer",
      "stack": "Python, C, SolidWorks, Arduino IDE, Git",
      "location": "Vancouver, BC",
      "dates": "Dec 2022 – Sept 2024",
      "bullets": [
        "Directed software design and system integration for a competition-ready autonomous robot with object detection, applying advanced Programming Language Theory for seamless integration.",
        "Programmed in Arduino IDE using C to develop algorithms for object detection, path planning, and robot control, achieving a 95% success rate in tests.",
        "Mastered SolidWorks for advanced 3D modeling and prototyping, enhancing design visualization and prototype development for an autonomous robot project.",
        "Integrated and programmed servo motors and ultrasonic sensors for obstacle detection and avoidance, increasing real-time perception efficiency by 25%."
      ]
    }
  ],
  "projects": [
    {
      "name": "UBC Thrifty Grocers",
      "stack": "Go, Postman, React, JavaScript, Tailwind CSS",
      "slug": "ubc-thrifty-grocers",
      "category": "fullstack",
      "bullets": [
        "Engineered high-performance back-end services for a grocery delivery platform using Go, leading to a 40% increase in server response speed, while quickly learning the language to contribute effectively to project success.",
        "Conducted extensive API testing using Postman and Bash Scripts, achieving a 100% success rate in test cases, ensuring flawless functionality and reliability of the web application.",
        "Applied security measures (CORS & proxies) and implemented access control logic in backend services to ensure users accessed only authorized resources, resulting in a 99% error-free deployment rate.",
        "Utilized React to create responsive webpages using Tailwind CSS for 50+ users to easily deliver groceries."
      ]
    },
    {
      "name": "Oil & Gas Asset Integrity Dashboard",
      "url": "https://github.com/zohairomar1/oil-and-gas-dashboard",
      "stack": "Power BI, SQL Server, SharePoint",
      "slug": "oil-gas-asset-integrity-dashboard",
      "category": "data",
      "bullets": [
        "Built a production-like Power BI solution to monitor integrity KPIs for natural-gas assets: corrosion rate (mmpy), oil content (ppm), SRB levels, overdue inspections, anomaly tracking, certification compliance.",
        "Modeled 24 months of data with Power Query + DAX; implemented role-based views for engineers vs. managers, slicers by department/month/year, and refresh simulation.",
        "Enabled proactive planning with backlog alerts and compliance trend summaries for stakeholder reports."
      ]
    },
    {
      "name": "nwHacks 2024: Comfort Corner",
      "url": "https://github.com/zohairomar1/ComfortCorner",
      "stack": "JavaScript, HTML/CSS",
      "slug": "nwhacks-2024-comfort-corner",
      "category": "hackathon",
      "bullets": [
        "Led the development of a mental health support website at Western Canada's largest hackathon nwHacks 2024, achieving a top 10 placement with 653 participants.",
        "Successfully integrated OpenAI API to power a specialized chatbot created for mental health assistance, leveraging advanced natural language processing techniques to provide empathetic and accurate support.",
        "Designed and implemented a user-friendly interface featuring quotes and resources, enhancing visitor engagement."
      ]
    },
    {
      "name": "Business Tracking Application",
      "url": "https://github.com/zohairomar1/BusinessTrackingApp",
      "stack": "Java, JUnit, JSON, UML",
      "slug": "business-tracking-application",
      "category": "fullstack",
      "bullets": [
        "Developed a Java-based application using OOP principles and software development practices to help businesses track purchases and analyze revenue data.",
        "Built an interactive GUI with Java Swing for adding, filtering, and visualizing purchases; implemented unit tests with JUnit to ensure system reliability."
      ]
    },
    {
      "name": "Heart Disease Prediction Model",
      "url": "https://github.com/zohairomar1/HeartDiseasePredictionModel",
      "stack": "R, tidyverse, Jupyter",
      "slug": "heart-disease-prediction-model",
      "category": "data",
      "bullets": [
        "Built predictive ML model to classify heart disease likelihood based on 300+ patient records.",
        "Applied KNN algorithm after performing data cleaning, feature scaling, and statistical analysis.",
        "Achieved 83% model accuracy and visualized feature impact; emphasized predictive modeling and business insight."
      ]
    },
    {
      "name": "CalgaryHacks 2025: WildBC",
      "url": "https://wilf-life-climate-change-crisis.vercel.app/",
      "stack": "TypeScript, Next.js, React",
      "slug": "calgaryhacks-2025-wildbc",
      "category": "hackathon",
      "bullets": [
        "Co-developed a web application in a 24-hour hackathon to raise awareness of wildlife conservation in British Columbia in the context of climate change.",
        "Built an interactive map visualizing endangered species and wildfire locations with clickable insights to support public education and engagement.",
        "Implemented a timeline feature to track wildfire events over time, including incidents through 2025.",
        "Created an educational hub with videos, articles, quizzes, and leaderboards to encourage learning through interactive content.",
        "Designed a discussion board to support expert Q&A and community conversations, and integrated event listings for conservation workshops and outreach."
      ]
    },
    {
      "name": "Production Analytics & Forecasting Dashboard",
      "url": "https://github.com/zohairomar1/volve-production-forecast",
      "stack": "Python, Streamlit, statsmodels, Plotly, Power Automate",
      "slug": "production-analytics-forecasting-dashboard",
      "category": "data",
      "bullets": [
        "Built an interactive analytics dashboard to explore and validate time-series operational data (2008–2016), improving stakeholder visibility into trends and exceptions.",
        "Developed rolling-origin backtesting to benchmark ETS forecasts vs. a seasonal naive baseline, achieving 45% lower MAE and 46% lower RMSE on the default evaluation view.",
        "Supported testing and defect-style validation by implementing a metrics pipeline (MAE, RMSE, MAPE, WAPE) with near-zero handling for stability and clearer interpretation.",
        "Implemented a Power Automate workflow that ingests exported forecast/anomaly CSVs, generates a summary email from templates, and distributes results via Outlook on a scheduled or event-based trigger."
      ]
    }
  ]
}
